[
  {
    "title": "Genopets",
    "short_description": "Genopets is the world's first Move-to-Earn NFT game that incentivizes players to stay active and earn for free.",
    "full_description": "Inspiration:\nThe idea for Genopets was born from our prior work in digital health exploring ways to use a health data marketplace to provide passive income to individuals as an incentive to stay active. While the infrastructure and industry for that concept was too early, we remained steadfast in the vision for passive income for health and pivoted to the Play-to-Earn gaming model earlier this year. We’ve been blessed with narrative tailwinds and growth in this industry and are excited to keep innovating and growing with the community. With Genopets, not only do we hope to financially incentivize players to stay fit, we can encourage them to do so and have fun while doing it.\n\n\nWhat it does:\nGenopets is a Free-to-Play, Move-to-Earn NFT game on Solana that makes it fun and profitable to live an active lifestyle. Genopets combines user's step data from their mobile device and wearables with blockchain Play-to-Earn economics so players can earn crypto for taking action in real life as they explore the Genoverse evolving and battling their Genopet.\n\n\nHow we built it:\nWe built this on top of Metaplex’s codebase - specifically the Token Metadata Program allows us to create mutable NFTs and update them at minimal cost. In the future, we intend to partner with Stardust to make this process even more seamless. The front-end is built using Unity and will be deployed to mobile. On the backend we have a simple REST API that performs simple operations such as minting NFTs and mutating them. For the minting process we currently use React / Next.js on the web and THREE.js for the graphics.\n\n\nChallenges we ran into:\nThe main challenge we faced was getting the API of the metadata program correct when it was released before the Anchor framework and had no IDL to use. Then we realized that the metaplex repo had JS bindings for all the metaplex programs and that made things a lot easier. The second challenge was to get the augment body parts to be dynamic, which we ended up using a simple unity function to achieve for now but will move to an attachment system later.\n\n\nAccomplishments that we're proud of:\nOne thing we are most proud of is that over the course of this hackathon, our community has grown significantly. Today we have more than 55k members on our Discord server and 28k followers on Twitter. This has helped validate the direction we’re headed and motivated our team to keep pushing to build throughout the competition.\n\n\nWhat we learned:\nKeeping logic and state completely separate may be hard to reason about at first, but becomes super elegant as you become familiar with it. For one, we basically don’t need to touch rust as most of the logic we need to utilize are already deployed on-chain. This allows us to use Javascript bindings very heavily to achieve what we need to do.\nOn the game and economics design side, one of the main things we learned from our deep research into Play-to-Earn games is that the problem with the primary net inflow of cash into your economy coming from new players joining your game is that it too closely ties the stability of your economy to continued user growth. The point at which user growth stalls, the entire game economy could collapse. That is why we designed Genopets to be a crafting and evolution game where the net inflow of cash to the economy comes from players’ active use and enjoyment of the game.\n\n\nWhat's next for Genopets:\nFollowing the listing of Genopet Egg NFTs on FTX.us earlier this week, our Genesis Genopets NFT Mint drop is expected mid November, followed by a release of a private beta of the full game by the end of the year. Follow us on Twitter and join our Discord community for the latest updates.\nTwitter:https://twitter.com/genopetsDiscord:https://discord.gg/genopets\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "react",
      "solana",
      "three.js",
      "typescript",
      "unity",
      "web3",
      "webgl"
    ],
    "url": "https://devpost.com/software/genopets-zs1la5"
  },
  {
    "title": "StepN by Find Satoshi Lab",
    "short_description": "StepN is a move2earn mobile game. It aims to attract million of non-crypto runners to the crypto realm through playing the game, whilst some game's profit goes to carbon offsetting.",
    "full_description": "Inspiration:\nInspired by Australian bush fire in 2021, we want to create a project to contribute to carbon neutralization. The idea started to get a clearer shape after we saw the success of Game-Fi, we gave it a little twist, we changed game mechanics from play2earn to move2earn, where game’s profit is decided in a DAO manner – with a minimum 10% goes to carbon reduction.\n\n\nWhat it does:\nFind Satoshi Lab is the company behind the design of StepN, it is a mobile game pays players game token for each step they move; game token can be earned either passively or actively, and governance token can be earned after player hits max level. To play the game, playermusthave a NFT sneaker, which can be bought or rent at no cost. Player can level up, add gemstones and produce new NFT sneakers in game through burning game tokens and/or governance tokens.\nPlayer can participate online Marathon to compete for top leader-board position and get rewards, or spend energy to do a power run to earn not only game/governance tokens, but also achievements and NFT badges. Certain NFT badges allow player to have certain perks in-game.\nThe essence of the game is to create a massive funnel to get non-crypto runners to the crypto community, starting from get them earn some tokens in their wallet by walking or running. Once they have some tokens in their wallet, they will think about cashing out, this will motivate them to learn how to use decentralized wallet and register to exchanges.\n\n\nHow we built it:\nThe idea of move2earn comes from a brainstorm session, where we initially wanted to do a Monopoly style game, during the discussion of how many steps a player should move on the play-board, one option was the player has to physically make the move, and we loved this idea. The entire game was then rebuilt around this move2earn concept.\nSeveral game development documents were drafted and refined, when we structured the game, we studied the popular Game-Fi on the market and concluded a successful mobile Game-Fi has to be able to transfer game asset conveniently, promptly and cheaply. So, we build the game around a built-in decentralized wallet that can transfer multiple chain’s assets, a swap and cross-chain convert. After comparing and contrasting several top public chains, we picked Algorand and Solana to build on, Solana won because we found deploying on Algorand requires more works and its smart contract function is yet to be released.\nOur perception changed several times during we made this game, initially we think the financial part is important, because this is what draw people to play the game. Then we realized what really retain players is the game itself, there will always be a game that can makes more money in the future, if the financial part is the only thing retains the player, it will most likely fail when the next big thing come out. Hence instead of rushing the game, we then returned to the drawing board and refined on our game parts. We added a comprehensive achievement/challenge system, and we NFT it and develop further game plots to put a value/meaning to these NFT badges, this could be the biggest player retainer to us.\n\n\nChallenges we ran into:\nNFT sneaker design (working on it).\nGame's balance among runner, gamer and crypto player (solving - game will not display features if it is not intended to certain player type, e.g. sneaker renter will not see gem socket, level up or sneaker production; we are also working on attribute modeling).\nIt is hard to involve \"gene\" in the production of sneaker section (solved through mystic sneaker socket)\nGame token always have a high sell pressure (solved through design a token sunk - gemstone, and a consistent token drain for consistent token earn - repair system)\nAnti-cheating mechanism design (solving through machine learning).\n\n\nAccomplishments that we're proud of:\nOne co-founder ran 200kms in a month to test all running apps, then had his appendix and 1/3 colon removed due to appendicular mass. Work carried out even he was immobilized on hospital bed.\nFinished UI design v2, working on v3, working toward internal test end Oct and MVP end Nov.\nComplete seed round with 3 times over subscription, investors are all tier-1 investment firms, both crypto native and traditional funds.\nHave advisors from game, running app and blockchain industries to help us refine the product.\n\n\nWhat we learned:\nA good game producer can save a lot of time and head scratching (lucky we have one with 15 years experience).\nDon’t exercise right after eating.\nGive project a good name is very hard work (still working on it)\nDon’t start pitching capitals until the team find what is the real pain point or sweat spot.\nA good Game-Fi project must be a good game first, a smooth-running application second, and has a tokenomic that makes sense third.\nSometime focusing too much on the nitty gritty makes you lose perspective; we need constantly tell ourselves what is our vision and stop tunnel vision on things.\n\n\nWhat's next for Find Satoshi:\nFinish private round and release MVP in Nov, use fund raised to get 1 million non-crypto players before the end of this year.\n24th Oct Update\nv2.o working demo is available for testing, feature include:\nGPS tracking fuction;\nLevel up sneaker;\nMystery Box looting;\nBetter user account interface;\nBetter sneaker detail page;\nSimplified version of wallet.\nv2.0 demo video:https://youtu.be/-0nS-ZtJmkU\nAddressing to judging criteria\nPotential ImpactStepN has potential to bring tenth of million new users to solana ecosystem through funneling runners to crypto player.\nFunctionalityThe project is in alpha testing and we will start public beta testing within a week.\nNovelty\nThere is no move2earn game on mobile devices other than ours.\nDesign\nWe have several well experienced game developer and UI/UX designer working on this proejct.\nGo-to-market Strategy\nWe will start from building crypto community before the full product releases to the market, after the full product release, we will focus on non-crypto runners and leverage main stream media on the topic of carbon reduction.\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "amazon-web-services",
      "java",
      "javascript",
      "linux",
      "mysql",
      "node.js",
      "rust",
      "solidity",
      "typescript"
    ],
    "url": "https://devpost.com/software/find-satoshi"
  },
  {
    "title": "Soapy Finance",
    "short_description": "Building The Future Entrance of DeFi for Community",
    "full_description": "Inspiration:\nWith the rapid growths of blockchain and DeFi, there are more and more DeFi projects establishing continually, but they are relatively isolated, which leading to three obvious problems.\nAlthough there are so many opportunities in the DeFi world, the market changes with each passing day. So far, there is no mobile APP based on the APY ranking that can help users to discover, search and analyze DeFi projects as fast as possible.\nFor example, I want to know which staking pool of USDT or ETH has the highest APY return across multi chains? Which staking pool's TVL & APY grows rapidly? How about the changing trend of TVL & APY? When will the launch of the new projects be? A great number of questions as mentioned above.\nHowever, such difficulties inspire us to create a mobile entrance for community users to participate in and find the opportunities for DeFi.\n\n\nWhat is Soapy?:\nSoapy Finance is committed to building the future mobile entrance of DeFi. It brings friendly, efficient, and secure financial products and services to users.\nSoapy is governed bySoapy DAO, all community members who holdSOAPYcan participate in project governance.\nAt present, it consists of two major parts:\n\n\nHow we built it:\nWe are a dynamic start-up team, and our core R & D personnel have been involved in the crypto field since 2017. We have a complete design and R & D process. APY.TOP is our first product, which supports H5 / Android / IOS access. At present, a beta version has been launched. Soapy Swap will be available in the near future.\n\n\nChallenges we ran into:\nThere are too many chances and tracks in blockchain development. We always focus on the infrastructure and data-analyze products of DeFi. In the further, the full cross-chain swap scenario will be also preliminarily planned. There are still some challenges in this area\n\n\nAccomplishments that we're proud of:\n\n\nWhat we have learned:\nWe believe that the development of blockchain is still at an early stage, the popularity of DeFi is not enough, and there is plenty of room for development. What problems we have been thinking about and the mission of our efforts is to help users participate in DeFi more quickly and conveniently.\n\n\nWhat's the next for Soapy Finance:\nAccording to the roadmap, we will focus on product development.\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "android",
      "es",
      "java",
      "objective-c",
      "python",
      "redis"
    ],
    "url": "https://devpost.com/software/soapy-finance"
  },
  {
    "title": "Bunny Army",
    "short_description": "Bunny Army is a decentralized Gamefi+NFT tower-defense game, with excellent experience and income from entertainment. It will firstly launch on OEC.",
    "full_description": "Inspiration:\nHope to make gaming NFT's value be embodied more clearly and also be combined with the game itself at the same time through the design of the GameFi system in a fun way.\n\n\nWhat does it do:\n\"BUNNY ARMY\" is a tower-defense strategy game developed and operated by the Jswap team. Players can enjoy the thrill of the game while obtaining corresponding incentive rewards.\n\n\nHow we built it:\nBy using the cross-platform game engine - Unity for development, and making the character animations by Spine. Be integrated with blockchain - NFT.\n\n\nChallenges we ran into:\nHow to build a \"simple but not easy\" game. On one hand, we want the player to be engaged and challenged. On the other hand, the game levels should be beatable.\n\n\nAccomplishments that we're proud of:\nBring the gaming community to blockchain game initiatives developed on OEC.\nBuild an entrance for Blockchain Game Metaverse.\n\n\nWhat we have learnt:\nBushnell's Law: All the best games are easy to learn and difficult to master.\n\n\nWhat's next:\nProduce more interesting levels and characters.\nIn-game items are NFT assets that are for sale and swap on the GameFi Marketplace.\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "oec",
      "react",
      "solidity",
      "spine",
      "typescript",
      "unity"
    ],
    "url": "https://devpost.com/software/jswap-finance"
  },
  {
    "title": "DarleyGo",
    "short_description": "The first mythical-based NFT horse racing game on Solana.",
    "full_description": "Inspiration:\nOur team is composed of hardcore horse racing enthusiasts, skilled mobile game and blockchain developers, and game and movie graphic designers (ex-Racingland, Tencent, Alibaba, Mastercard, Capcom, and Bandai Namco). For many years, we have always wanted to build a horse racing game that solves the major problem of all the Horse Racing Video games out there: monetization. After years of exploration and research, we think now is the best time to build one, as the technology has grown more mature (Blockchain, NFT, and Solana) and because of public adoption (Blockchain, Cryptocurrency, and NFT).\n\n\nWhat it does:\nDarleyGo is the world's first mythical-based NFT horse racing game that's built on Solana, which allows players to purchase, race, collect and breed NFT horses. With the implementation of NFT, players can trade their in-game assets such as horses, and other in-game collections over any public NFT marketplace.\n\n\nHow we built it:\nFront end\nSolana Program\n\n\nChallenges we ran into:\nThis time, the most significant challenge was that we only had two weeks to build everything after joining the Hackathon. Since our project just started when we joined the Hackathon, we basically had to build everything from scratch.\n\n\nAccomplishments that we're proud of:\nFrom all game graphics and style, frontend, to the backend, we've built everything in two weeks. We are really proud of what we've accomplished within the given time.\n\n\nWhat we learned:\nTwo main things we've learned and deepened our knowledge during this Hackathon:\n1, Writing Solana Smart Contacts\n2, Creating NFT and saving data on the Solana network\n\n\nWhat's next for DarleyGo:\nWe are just getting started. We have many ideas and plans (such as…adding more in-game NFT assets such as jockey, equipment, and many more in-game items,  and integrating our game horses with the real world horses for racing with the AR/VR technology) for developing the game further, and are very confident that we are capable to build and implement our ideas and plans. However, to make the game a smash hit and a true Metaverse, we believe we need to connect with more parts within the Solana ecosystem to create synergy (Such as Dex, NFT Marketplace, games collaboration, and more...)  for reaching our ultimate goal!\nOur vision is to bring DarleyGo not only to crypto gamers but also to traditional gamers and horse racing fans, introducing more non-crypto people to the Blockchain world.\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "javascript",
      "nextjs",
      "node.js",
      "pixijs",
      "react",
      "rust",
      "solana"
    ],
    "url": "https://devpost.com/software/darleygo"
  },
  {
    "title": "Pinc (Stands for Personal, Inclusive and Collaborative)",
    "short_description": "Eliminating one lump at a time and helping any individual at any corner in the world prevent or fight breast cancer and reducing the global mortality rate by channelizing the power of collaboration",
    "full_description": "How we built it:\n1)Agile methodology and JIRA is considered as a project management tool\n2)Azure-DevOps for CI/CD, AWS Polly for Text to Speech Conversion \n3)Python and Jupyter is used for building Deep Learning neural networks and Machine Learning based models\n4)JUSTINMIND is enabled for building the prototype of the Mobile Application\n\n\nChallenges we ran into:\nWith the limited understanding on Medical Field we have to discuss our thought process with various health professionals and specialists to come up with entire process flow and data for building Artificial intelligence. \nConsidering the COVID Situation discussing with individuals and  understand their challenges was difficult. Our study was limited to consulting with medical professionals.\n\n\nAccomplishments that we're proud of:\nIn a short duration, we were able to build an application which can cover all the aspects like awareness, prevention and fight against breast cancer. \nWe were able to work collaboratively with our team as well as discuss with various medical professionals to get a complete insight and hence were able to build a robust solution prototype.\n\n\nWhat we learned:\nWe have identified all current challenges and gaps which are there in existing systems for breast cancer. We became ourselves aware of social and physical impact of breast cancer and campaigns or initiatives around the globe. Hence ,We were motivated to bridge all these gaps and think holistically to  come up with a robust solution Pinc.\n\n\nWhat's next for Pinc (Stands for Personal, Inclusive and Collaborative):\nWe would like to have a successful implementation across the globe with collaboration among various groups and individuals.\nWe would like to be a part of the cause in reduction of mortality rate by increasing the early detection of breast cancer.\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "ai",
      "amazon-web-services",
      "azure",
      "jira",
      "justinmind",
      "polly",
      "python",
      "scikit-learn",
      "visualization"
    ],
    "url": "https://devpost.com/software/pinc-stands-for-personal-inclusive-and-collaborative"
  },
  {
    "title": "-",
    "short_description": "-",
    "full_description": "Selection of the challenge:\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "javascript"
    ],
    "url": "https://devpost.com/software/hera-njv7mw"
  },
  {
    "title": "Lightning Network enabled Vending Machine",
    "short_description": "Vue.js application for accepting Bitcoin Lightning payments, using the OpenNode API, and notifying the iozeta CryptoVend.",
    "full_description": "Built With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "amazon",
      "html",
      "javascript",
      "node.js",
      "opennode-fire-iozeta-cryptovend",
      "vue"
    ],
    "url": "https://devpost.com/software/cryptovend-tablet-ui"
  },
  {
    "title": "SolanaSail",
    "short_description": "SAIL is the first ever community token built on Solana & fully distributed(airdrop). \r\nSAIL is the utility token, gSAIL the governance token.",
    "full_description": "What's next for SolanaSail:\nCompletion of our tipsailbot integration in our discord battleship game(on going). Then after more playtoearn game could be developed(Poker, BlackJack....), the governance DAO will proposed and decide.\nA governance DAO platform using part of Mango DAO Governance code.\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "discord.js",
      "node.js",
      "web3.js"
    ],
    "url": "https://devpost.com/software/solanasail"
  },
  {
    "title": "Okex Fly Game",
    "short_description": "A wonderful trip, The Classic of Mountains and Rivers + NFT, the mysterious elements of the East met the modern technology, the two will create what kind of effect?",
    "full_description": "Built With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "linux",
      "php",
      "solidity",
      "web"
    ],
    "url": "https://devpost.com/software/okex-fly-game"
  },
  {
    "title": "ParkKing",
    "short_description": "ParkKing helps foster culture of parking discipline among citizens and manage their bookings & violations online.",
    "full_description": "Inspiration:\nBeing a citizen of Indore, lack of parking discipline among citizens was being felt as the major challenge touching everyday life. Another challenge was shortage of authorized and known parking spaces leading to traffic chaos specially in peak times and seasons, more so as the city scales up. Inspired by digital India initiatives including smart city, and a strong desire to solve this major problem, along with an effort to bring about parking discipline culture in the city led to this innovative solution.\n\n\nWhat it does:\nThe key focus of this solution is to empower city traffic department, parking site vendors and citizens to join hands for mutual benefit. ParkKing is a 360 degree parking solution offering each stakeholder with the desirable information and control. ParkKing offers app for citizen and parking site (for embedded device) and a management plus analytics console for the City Traffic Department.\nCitizens can use ParkKing app to find and book an authorized parking on the go. They can report parking violations and get alerts for their violations before e-challan gets issued. Additionally, they can suggest a parking site and request to enable online booking for the same.\nParkKing awards citizens in a unique way with reward points and levels to promote parking discipline and use of authorized parking in the city. It offers a distinguished set of benefits and discounts to users on different levels. Rewards can be redeemed in various ways including parking charges payment.\n\n\nHow we built it:\nParkKing consists of four main components:\n\n\nChallenges we ran into:\n\n\nAccomplishments that we're proud of:\n\n\nWhat we learned:\n\n\nWhat's next for ParkKing:\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "android",
      "android-studio",
      "css",
      "html",
      "javascript",
      "mysql",
      "php"
    ],
    "url": "https://devpost.com/software/parkking-dlf96r"
  },
  {
    "title": "Lucidchart OnPrem for Confluence Server",
    "short_description": "Others are going cloud—we're taking our top web-based add-on to OnPrem with cutting edge functionality in Confluence",
    "full_description": "The story:\nOne of the top Confluence & JIRA add-ons,Lucidchartis the leading online provider of diagramming, charting, wireframing, mockup, and now presentation software (all in one application). With over 5 million users worldwide, almost everyone had access to Lucidchart.... except customers that required onpremises storage of their documents.\nEnterLucidchart OnPrem for Confluence Cloud.We built Lucidchart OnPrem to provide our cutting edge technology to customers sitting behind firewalls, and also to offer a Paid-by-Atlassian add-on within the marketplace.\n\n\nInspiration:\nOver 300+ customers have requested an onpremises add-on from Lucidchart. We built this for them, and for all the others who wanted Lucidchart, but were unable to adopt our cloud-based solution.\n\n\nWhy it's special:\nWhile we were not able to replicate all ofweb-based Lucidchart'sfunctionality (e.g., mobile apps, @mentioning, free integrations, etc.), we still wanted to deliver the premier self-hosted solution for Confluence. Below are a few features that only we are able to offer to customers behind firewalls.\nAll of these features come in addition to the standard functionality of creating, editing, and embedding diagrams, charts, and visuals to improve communication in Confluence. Lucidchart also includes extensive templates and shape libraries for network diagrams, flowcharts, UML diagrams, UI mockups, Venn diagrams, org charts and more.\n\n\nHow we built it:\nWe reimplemented some of the back end code of our cloud app within the Confluence environment and tweaked the front end to work with it. In the process we had to make significant changes to core system concepts like users, collaboration, comments, diagrams, and attachments so that they make sense on this new platform. Since this add-on has to work on instances without any internet access, we had to bundle all the necessary resources (js, css, images, fonts, templates, etc.) inside the add-on instead of loading them on-demand from a CDN.\nImplementing some of our unique features like real-time collaboration was particularly challenging as this is not a feature implemented for Server-based add-ons, and the approach was new to the add-on ecosystem.\n\n\nChallenges we ran into:\nWe ran into several major challenges in taking the functionality of our add-on from the cloud to fully onpremises. Among these were challenges enabling real-time collaboration, using an embedded rich viewer within Confluence to create slide shows, and taking our 100% cloud-based functionality into a format that can be used entirely behind a firewall.\n\n\nWhat's next for Lucidchart OnPrem for Confluence Server:\nWe are currently taking the lessons we learned from building Lucidchart OnPrem and applying them to our web-based Lucidchart add-on. These changes will make both products faster, more reliable, and more valuable to our end users. Aside from the business push, we also plan to continue iterating and improving upon the add-on based on customer feedback. For instance, we will be releasing a new version with improved revision history controls shortly.\n\n\nSummary:\nJust like taking a Server-based add-on to the Cloud, taking Lucidchart to the Server was challenging and required many large and small changes to our existing product to deliver an excellent solution for our customers. We hope you'll enjoy testing Lucidchart OnPrem. Feel free to give us your thoughts as we are always working to make our products better, faster, and smarter. Thanks!\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "atlassian",
      "aui",
      "confluence",
      "google-closure-compiler",
      "java",
      "javascript",
      "less"
    ],
    "url": "https://devpost.com/software/lucidchart-onprem-for-confluence-server"
  },
  {
    "title": "Freebie",
    "short_description": "This is an application for people to exchange resources and support during calamity and donors to make donations",
    "full_description": "Inspiration from the people who face a lot of crisis in resources and we decided to help them with our tech by creating an application to help and ask for help at any time.:\n\n\nThis application is helpful in balancing the resources by sharing them among the needy.:\n\n\nThis application is entirely built on the top of Pega Platform of version 8.2:\n\n\nThe challenges in this application are making requests live and updating the status of request to both requestor and donor.:\n\n\nThe accomplishments made in this application are handling live requests and fully customized Reports and harnesses in portals.:\n\n\nWe have learned the customization of harness and configurations of activities.:\n\n\nWe as a team will enhance the application and put forward our efforts to bring out new innovations.:\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "pega",
      "version8.2"
    ],
    "url": "https://devpost.com/software/careteam-nlz5jc"
  },
  {
    "title": "AIMF",
    "short_description": "Built upon Pega's Powerful Intelligent Automation, Cosmos-UI, & Mashup capabilities, AIMF aids organizations to conduct efficient inspections with better governance and quality of citizen services.",
    "full_description": "Inspiration:\nGovernment officials are increasingly finding it difficult to adhere to quality, meet deadlines, streamline user experience, and act swiftly, without the power of low-code enterprise digital process automation. Gartner Study on Governments and Technology says, by 2023, at least 85% of governments without a total experience (TX) strategy will fail to successfully transform government services.\nMajor Government services like performing inspections are taking enormous time, cost, and energy due to siloed websites being ineffective in meeting quality standards and building total experience for users. The disjoint legacy systems don’t have the ability to scale and change quickly as per the regulations or intelligently handle automations for increasing productivity.\nWe wanted to extend our expertise and achievements in building efficient inspection solutions in EMEA region to other regions for providing easier Governance and better quality of life for citizens. AIMF (Aaseya Inspection Management Framework) uses state-of-the-art Intelligent Automation capabilities of Pega, for increasing inspector productivity by its built-for-change features, that help in ensuring inspections are always conforming with the evolving standards, policies, and guidelines.\n\n\nWhat it does:\nAaseya’s Inspection Management Framework (AIMF) allows the Governments to extend a common reuse framework, by following the Top of the T approach, to various Inspection categories like Health, Food, Hospitals, Security, Buildings, Roads, Environment, Industries, Hospitality, etc.\n• AIMF allows the Governments to reuse and extend the built-in framework to include various Inspection categories (like Health, Food, Hospitals, Security, Buildings, Roads, Environment, Industries, Hospitality, etc.), associated regulations and violations details.\n•  It has a highly configurable Questionnaire Framework that will enable the business users to configure checklists, related questions, and configurable answer options, that can be mapped for the related business activities of the Inspection categories.\n• The admin module allows for easy management of scheduled/periodic inspections and configurations for extending each data type by means of delegated data objects with easy excel import of new categories, clauses, etc.\nAIMF aims to improve the audit and inspection experiences, ensure quality adherence, scale with ease, automate intelligently to save time, increase inspector productivity, and provide total experience to citizens. All these capabilities are geared towards common goal of IT modernization needs of Governments and Organizations, to enable efficient Inspections, cost savings, increased penalty collections, and being future ready with Pega’s AI capabilities.\n\n\nHow we built it:\nAlready for Governments, Pega has been playing an instrumental role with its Low Code Intelligent Automation platform, across Federal, State Governments, U.S. Census Bureau, etc. Aaseya also implemented several government projects like Saudi Ministry of Justice, Step Change, Schroders and also automated inspections for Saudi Ministry of Labor, Saudi Ministry of Municipal and Rural Affairs.\nAaseya understood the evolving industry need of inspections in various segments and along with our experience in building similar projects, we intend to come up with a vision to build and derive the comprehensive Inspection Platform solution  that takes the Intelligent Automation offering of Pega to the next level. Further it has the potential to make use of AI abilities to trigger the inspection events, anomalies that can be fed in to automate subsequent actions which helps optimize the overall inspection mechanism.\nDuring discovery we collated all the features we wanted to develop using design-thinking, storyboarding, and defined the MVP. During Build we followed best practices by kickstarting development using Pega’s App Studio and created the application by first defining the Customer Journeys, Case Types, Personas, and Data Types. We then continued building and testing the features iteratively and went to executive leadership in Aaseya for demo feedback and review comments, which were incorporated in subsequent weekly iterations.\n\n\nChallenges we ran into:\nIt was not easy to come up with a questionnaire framework that could allow customization of questions, categories, options based on zones, inspection categories, etc., and allow changing answer types, display controls, options, etc., all through configuration. We were blessed to have a great team that was able to create a robust scalable design, that is fully functional and configurable.\nThe automated intelligent routing based on availability of inspectors and their mappings with inspection categories, zones, skills, etc., was also a good challenge, but decisioning capabilities of Pega were helpful in building the complex logic.\nLastly, the amazing user-experience was vital for making it easy for inspectors to achieve their goals efficiently and offline plus omni-channel capabilities of Pega were of great help! Right usability with different controls, like tree-view, carousel, etc., for best user experience across various devices, for making it intuitive and look great, was also a nice challenge to tackle, and kept us excited during the development journey.\n\n\nAccomplishments that we're proud of:\nWe chose to build the AIMF Solution using Pega’s Intelligent Automation Platform as a Framework for using it with Pega’s recommended Top of the T approach. By adopting the Pega Express Implementation Methodology, we were able to deliver Minimum “Loveable” Product within a short period. We have built a solid foundation for adding new features.\nWe were able to build below features that we believe could make inspection processes completely configurable to scale and execute easily, not just for Governments, but for any type of inspections or audits that an organization may want to carry out:\n\n\nWhat we learned:\nAcross the world, many large government organizations, have chosen the Pega Infinity Platform and Pega DX Architecture to implement solutions related to Defense and Intelligence, Justice and Public Safety, Revenue and Regulatory, Transportation, Healthcare and Agriculture sectors. AIMF is our foray in Government Digital Transformation journey, that is built on Pega’s Intelligent Business Process Management System (iBPMS) with low-code/no-code model-driven application development. AIMF safeguards public and government’s objectives of quality products and services and addresses such outcomes at scale.\nWe got experience of creating a solution that can suite any Government or Organization, whose primary objective is to protect and safeguard the interest of consumers by conducting inspections and identify fraudulent and inferior quality products and services. It was a unique experience building a solution that is so unique that it could cater to the inspection and control needs of the various types of points of service like marketplaces, restaurants, hospitals, construction areas, sanitation etc.\nWe explored to build the configurability around these inspection types and modelled them such that the specific needs and attributes of the service, can be parametrized and handled separately. That helped us build a state-of-art Inspection System as it allows each inspection category to be added as a top-on service on the robust base that permits configurability for new service deployments. Each category can have different kinds of inspections, periodicity, establishment classifications, capability to handle campaigns, onboarding of volunteers as inspectors etc. So, once the base framework is deployed, the sound architecture can provide for rapid releases for new inspection category additions.\n\n\nWhat's next for AIMF:\nWe want to continue developing AIMF and put it in Pega Marketplace.\nThe solution currently comprises of both desktop and mobile applications with mobile apps built specifically for field inspectors. Further to facilitating the inspection, the system also enabled inspectors to raise violations and apply fines. We primarily want to build capability to raise objections and run campaigns on the violations in next MVP.\nOur roadmap is to build some of the below features in AIMF and keep enhancing it further:\n• Route recommendations for Inspectors for GPS routing using him mobile device\n• Adaptive AI based skill-routing so that new skills are auto-updated to inspectors based on inspections successfully performed\n• Ability to launch Campaigns to target inspection of an inspection category and zone in a particular period, along with Campaign Dashboards for campaign performance evaluation \n• Ability to configure questions so that few questions can be highlighted as important\n• Inspectors to be able to see system generated score for specific inspection types based on past data for further assessment and approval \n• Ability to raise Objections so that Citizens can provide contradictory evidence against the inspections performed\n• Introduce CDH capability for detecting anomalies by gathering analytics on establishments for optimizing inspection schedules and periodicity accordingly\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "8.7",
      "cosmos",
      "intelligent-automation",
      "mobile",
      "pega"
    ],
    "url": "https://devpost.com/software/aimf"
  },
  {
    "title": "Flutter Love ❤️",
    "short_description": "Learn Flutter in an Interactive and Unique way.",
    "full_description": "Inspiration:\n\n\nWhat it does:\nThis puzzle app was mainly built keeping developers in mind. This app focuses on seamless & interactive ways to learn Flutter. As this is a unique approach, developers will gain much more interest in learning Flutter. As of now, it's just the basic themes that I have added. Down the line, I will be adding the themes for Rive Animations & others.\n\n\nHow i built it:\nAs I'm a beginner, I have gone through basic concepts, flow & architecture of Flutter Development. Then I started exploring the UI elements and stuff. Next, I wrote down the puzzle problem on a piece of paper to better understand how it is currently working and how (if possible) can i further optimise it by reducing the processing time.\n\n\nChallenges we ran into:\n\n\nAccomplishments that I'm proud of:\nCode to build App is an old way.\nApp to Learn Code is a new way that i tried. This is what I am proud of, for being helpful to the fellow developers :)\n\n\nWhat I learned:\nThe Flow: I understood the structure of Hybrid App Development for the 1st time. I understood how the classes interact with each other and how they interact with the native classes internally.\nBridges: I have implemented the wrappers (bridges) where the Hybrid classes can interact with Native classes/methods.\n\n\nWhat's next for Flutter Love ❤️:\nI would like to add tons of other puzzles something like a youtube playlist to let the developers learn Flutter with the help of my puzzle app. :)\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:\n\n\n1st Month Stats:\n\n\n3-Week Stats:\n\n\n1st Week Stats:\n** 2k Views & 500 Likes for the Demonstration Video in Youtube **\n** 500 Installs for the Demonstrated App in Google Play Store :)Youtube Video[https://play.google.com/store/apps/details?id=com.flutter.love]",
    "technologies": [
      "android",
      "dart",
      "firebase",
      "flutter",
      "ios",
      "rive",
      "web"
    ],
    "url": "https://devpost.com/software/flutter-love"
  },
  {
    "title": "CIGMA",
    "short_description": "The CIGMA platform will empower the citizens to actively raise issues, share suggestions and get their queries answered. They will become a core part of the digital ecosystem.",
    "full_description": "Inspiration:\nWith the advancements in technology and digital transformation being rapidly embraced in day-to-day life, citizens are now much more comfortable in leveraging technology to improve their living as well as to help the community. We wanted to build a platform that would be citizen centric and make the governance more transparent.\nThe CIGMA (Citizens Intelligent grievance management application) platform will empower the citizens to actively raise issues, share suggestions and get their queries answered. They would also be able to track their requests until resolution.\n\n\nWhat it does:\nWhen the citizens observe any issues in their community or if they have any suggestions, they will use CIGMA to raise a service request that will be sent to the administrative authorities of the council. This service request will include details like exact location of the issue (by leveraging google maps API), description, date, images etc. The council admin will be able to quickly narrow down on the issue and identify a remediation. After approvals from Councilor, required resolution will be provided. In future releases, CIGMA will be integrated with 3rd party contract systems to track end to end resolution.\n\n\nHow we built it:\nWe primarily made use of App studio to build out the case life cycle, data model, personas and channels. We also used the out-of-the-box location control to integrate with google maps API. We made use of PEGA's digital messaging to configure a web chat.\n\n\nChallenges we ran into:\nIn order to enable web chat using Digital Messaging, we learned that a set of keys need to procured from PEGA to view the Digital Messaging manager. Also, Digital messaging is not supported on personal edition, so we had to setup a lab instance to make it work.\n\n\nAccomplishments that we're proud of:\nWe were able to build a solution that empowers the citizens to drive transformation in their community. Citizens will get firsthand experience of how PEGA solutions can simplify processes and also become core member of the digital ecosystem.\n\n\nWhat we learned:\nAs App Studio was closely leveraged for development, we learned some of the advanced options in terms of building views, data modelling and integrations.\n\n\nWhat's next for CIGMA:\nCIGMA will expand with integrations to 3rd party contract systems that will help the Council to track the requests and issues within the application. NLP and process AI will be added to enhance the service experience for the Citizens. Also, the workflow and lifecycle of the Service Request will be expanded to match the processes currently in place for the UK Councils.\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "digital-messaging",
      "google-maps",
      "pega"
    ],
    "url": "https://devpost.com/software/cigma"
  },
  {
    "title": "Cronforce Time Tracking for Jira",
    "short_description": "Save valuable developer time and capture time directly from Jira. Now with worklogs and smart projects.",
    "full_description": "Inspiration:\nNormally developers keep track of their work hours inside Jira and then need to copy/paste this information into another system which is used by the whole organisation. This is why we built a smart clock tool that allows developers to clock time and then save as worklog entry. The entry including hours and comments  get automatically transferred to Cronforce.\n\n\nWhat Cronforce Time Tracking for Jira does:\nCronforce includes features such as:\n\n\nHow I built it:\nIt took us quite a lot of time because we already have an integration with Jira that connects from Cronforce to Jira and pulls all booked times. Now we had to implement the opposite plus ensure both integration work smoothly with each other as well as make the addon smarter and user friendly e.g. pre-select project to track etc.\n\n\nChallenges I ran into:\nWe did not run into particular challenges but we enjoyed the process very much and learned a ton about the inner workings of Atlassian products and Jira in particular.\n\n\nAccomplishments that I'm proud of:\nWe have mastered the Atlassian SDK and it helped us do some improvements on our own API.\n\n\nWhat I learned:\nAtlassian SDK, API best practices.\n\n\nWhat's next for Cronforce Time Tracking for Jira:\nWe will add some more features such as:\n\n\nCronforce - made with love in Berlin:\nUpdate: Here is our dedicated jira time tracking video:https://www.youtube.com/watch?v=Y6uRcYc2hMw\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "angular.js",
      "css3",
      "html5",
      "javascript",
      "jira",
      "json",
      "rest"
    ],
    "url": "https://devpost.com/software/cronforce-time-tracking-for-jira-dis5by"
  },
  {
    "title": "Lanatools",
    "short_description": "Dashboard, Portafolio, And Charting Solutions For The Solana Ecosystem.",
    "full_description": "I Been a Java Developer For The Past 5 Years. In Those 5 Years I Have Learned Many Other Languages Such as react js, typescript, javascript and angular 11. Solana Is Written In Rust so i took the challenge.:\n\n\nLanatools will be able to track all SLP tokens, Pool Liquidities, Track Wallet Portafolio balances and a staking option. In The Future we want to implement useful tools such as \"Create Your SLP Token With a Few Clicks\" And \"Create NFTs With No Coding Experience\":\n\n\nWe have been building this platform for a couple months now. Starting from 0 to hero. Only a few more weeks for our alpha release.:\n\n\nChallenges we ran into are Charting api, so we created our own. Other than that, everything has been very smooth so far.:\n\n\nSomething im proud of is that when i first read the Solana Docs, i had many questions that were not available elsewhere. The more i read, the more i learned.:\n\n\nI learned some rust.:\n\n\nWe have released our MVP and Is Live athttps://lanatools.com:\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "angular-11",
      "coingecko-api",
      "javascript",
      "node.js",
      "postgresql",
      "react-js",
      "solana-web3",
      "sql-server",
      "vultr"
    ],
    "url": "https://devpost.com/software/lanatools"
  },
  {
    "title": "LowbCraft",
    "short_description": "LowbCraft is a game of stacking cubes and constantly adventurous.",
    "full_description": "Inspiration:\nCome from minecraft.\n\n\nWhat it does:\nExplore your own unique world, survive the night, and create everything you can imagine!\nwatch the video：https://opensea.io/assets/matic/0x2953399124f0cbb46d2cbacd8a89cf0599974963/26273198471925277313353141987825348566112633703028005703181410322685758537729?chainIdentifier=matic&assetContractAddress=0x2953399124f0cbb46d2cbacd8a89cf0599974963&tokenId=26273198471925277313353141987825348566112633703028005703181410322685758537729\n\n\nHow we built it:\nWith unity3d.\n\n\nChallenges we ran into:\nCombine with blockchain.\n\n\nAccomplishments that we're proud of:\nAchieve it.\n\n\nWhat we learned:\nGamefi.\n\n\nWhat's next for LowbCraft:\nPublish the game.\n\n\nBuilt With:\n\n\nUpdates:",
    "technologies": [
      "bsc",
      "smartcontract",
      "unity"
    ],
    "url": "https://devpost.com/software/lowbcraft"
  },
  {
    "title": "NoQ",
    "short_description": "An optimised time-scheduling application to prebook TSA slots to enable airlines & airports deliver travelers a no-hassle, Covid-safe, flying experience",
    "full_description": "Overview:\nRecent pandemic has impacted the air transportation business and traveling is perceived as a risk-factor.\nThe security clearance processes at airports are tedious, confusing, and generally have long wait times during peak hours. The goal of this project is to provide an effective solution addressing this issue.\n\"NoQ\" allows users topre-bookand reserve their security slots online. It eliminates security queue times and eases the overall process for both the passengers and the TSA agents.\nPartnering with airports & airlines establishes a solid go-to market strategy which provides passengers a smooth, hassle-free on-boarding process.\n\n\nTeam Members:\nAshik Devakumar(Project Manager, Graduate Mechanical@ PFW) Ashik was responsible for scheduling all internal and external meetings. He created memos of each meeting and ran weekly planning sessions where the team agreed on a set of tasks for the week. Ashik also contributed to building revenue and business models and collaborated with the rest of the team to create this document.\nMichael Hall(Business Development, Junior Mechanical @Rose-Hulman ) Michael put together our online go-to-market strategy with some help from our GoSquad coach. Michael ran our customer discovery process, conducting interviews with potential customers in the last 2 weeks. He also helped with the environmental analysis, business models, and revenue models.\nRaviTeja Jorigay(UX Designer, Graduate Human-Computer Interaction @ IUPUI) RaviTeja helped in understanding the customer segment and created the persons, Empathy Maps, and Business models. He collectively worked with his squad members to develop a 3-year Revenue projection model. Ravi also helped the Pro squad by contributing his knowledge in prototyping and designed the UI’s of the screens.\nSumadhuri Damerla(Software Developer, Graduate Computer Science @ PFW) developed the database architecture and build the backend of our product. She was responsible for integrating the frontend and backend of the application as well as maintaining the git repository, deploying the app on Heroku server. She also worked on making the product demo presentation\nMerouane Baoch(Software Engineer, Sophomore @ Ivy Tech College ) Merouane helped in developing the frontend, CSS and worked on the schematic representation of the application. He also contributed project planning ideas to the GoSquad.\nDhruvin Patel(Software Engineer, Senior Computer Science @ IUPUI) Developed front end architecture as well as an integrated front end and back end codes of the application. He Created UI design using React.js, and Bootstrap. Maintain the data flow using react-redux.\n\n\nHow did we decide on this customer segment, problem, and solution?:\nObservational Research\nWe studied the different problems at Indianapolis airport due to COVID-19.\nInterviews\nWe interviewed TSA personnel to understand their hardships they are facing to maintain and regulate social distancing in long queues at the airport. We then interviewed air travel passengers to discover their pain points and turned them into insights.\nSystem models\nWe organized this information into different process maps to better understand the pains/gains.\nOpportunities\nWith the long queues at security processes being a potential space for COVID risks, it is difficult for both the staff and the passengers to manage and maintain a standard social distancing protocol.\nUnder the given constraints, we cannot change the TSA rules and procedures but we could focus on a component of the system. We introduced a slot-booking concept for the TSA security lines which would make the process smoother, quicker, and minimize COVID exposure (a win-win solution).\n\n\nWho will benefit from our project?:\nAirports, Airlines, and Passengers\n\n\nHow did our team build and iterate on the solution?:\nResearch&Brainstorming sessions\n1.Identified problems that passengers are currently facing at the airport\n2.Created customer personas based on the interviews and other research\nPrototyping\nDevelopment\nBusiness models\n\n\nKey Metrics:\nRevenue Growth\nWith the calculated regional expansion strategy, NoQ could obtain a profit of 2.3M$ at the end of 3 years\nProduct Testing\nTested with 35 different users\nWait time Reduced Per Passenger\nAn average of 20 - 45 minutes reduced on a crowded day\nAn average of 10 - 20 minutes reduced on a less crowded day\n\n\nTechnical Details and Diagrams:\nPrototype\nNoQ Prototype- Adobe XD\nInformation Architecture\n\nUser flow Diagram\nDatabase Diagram\nBusiness Logic Diagram\nWeb application\nTools and libraries\n\n\nIf we had another 5 weeks to work on this, what would we do next?:\nOur web application enables users to travel from Indianapolis airport to pre-book their TSA slots. Probable phases\n\n\nRevenue Model:\nBased on the statistical data gathered from the Bureau of Transportation statistics, we have calculated the revenue and projected a potential three-year forecast.\nPlease follow the attached link for the detailed3-year revenue generation forecast\n\n\nChecklist of Completed Items:\n\n\n\nLink to our slides!:\nPresentation Slides\n\n\nBuilt With:\n\n\nTry it out:\n\n\nUpdates:",
    "technologies": [
      "express.js",
      "heroku",
      "mongodb",
      "node.js",
      "react",
      "restful"
    ],
    "url": "https://devpost.com/software/techpoint-submission-test"
  }
]